# -*- mode: org -*-

#+BEGIN_SRC sh :results output :exports both
make run CLASS=KMP ARGS="abra aaabbbabracadabra"
#+END_SRC

#+RESULTS:
#+begin_example
text:    aaabbbabracadabra
pattern:       abra
digraph {
  0 [label="0"]
  1 [label="1"]
  2 [label="2"]
  3 [label="3"]
  4 [label="4"]
  0 -> 0 [label="b,r"]
  0 -> 1 [label="a"]
  1 -> 0 [label="r"]
  1 -> 1 [label="a"]
  1 -> 2 [label="b"]
  2 -> 0 [label="b"]
  2 -> 1 [label="a"]
  2 -> 3 [label="r"]
  3 -> 0 [label="b,r"]
  3 -> 4 [label="a"]
}

#+end_example

#+BEGIN_SRC sh :results output :exports both
make run CLASS=KMP ARGS="abrc aaabbbabracadabra"
#+END_SRC

#+RESULTS:
#+begin_example
text:    aaabbbabracadabra
pattern:                  abrc
digraph {
  0 [label="0"]
  1 [label="1"]
  2 [label="2"]
  3 [label="3"]
  4 [label="4"]
  0 -> 0 [label="b,c,r"]
  0 -> 1 [label="a"]
  1 -> 0 [label="c,r"]
  1 -> 1 [label="a"]
  1 -> 2 [label="b"]
  2 -> 0 [label="b,c"]
  2 -> 1 [label="a"]
  2 -> 3 [label="r"]
  3 -> 0 [label="b,r"]
  3 -> 1 [label="a"]
  3 -> 4 [label="c"]
}

#+end_example
